In [1]:
# 최초 1번 실행블록

import cx_Oracle
import matplotlib as mpl # 그래프 옵션
import matplotlib.pyplot as plt # 그래프 출력
import pandas as pd

cx_Oracle.init_oracle_client(lib_dir="/Users/ijaehun/Downloads/instantclient_19_8")
connection = cx_Oracle.connect(memberDTO="admin", password="Chldudcjf12!", dsn="db20220709105045_low")
cursor = connection.cursor()

### 1. cursor를 이용하여 DB접속  
### 2. 쿼리문을 이용하여 데이터 추출 후 메소드로 구현
---

### - 메소드 파라미터 : 년도, 분기, 업종, 지역이름  

## 매출 합계
1. 요일별 - salesByWeek()
2. 평일&주말 - salesByWeekAndWeekend()
3. 시간대별 - salesByTime()
4. 성별 - salesByGender()
5. 나이별 - salesByAge()

## 매출 건수
1. 요일별 - countByWeek()
2. 평일&주말 - countByWeekAndWeekend()
3. 시간대별 - countByTime()
4. 성별 - countByGender()
5. 나이별 - countByAge()

# -------------------------------- 매출 합계 --------------------------------

## 요일별 매출 합계

In [4]:
def salesByWeek(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(MON_SELNG_AMT), " +
                       "SUM(TUES_SELNG_AMT), " +
                       "SUM(WED_SELNG_AMT), " +
                       "SUM(THUR_SELNG_AMT), " +
                       "SUM(FRI_SELNG_AMT), " +
                       "SUM(SAT_SELNG_AMT), " + 
                       "SUM(SUN_SELNG_AMT) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    salesByWeek = pd.DataFrame(rows, columns=col)
    
    return salesByWeek

salesByWeek(2018, 1, '한식음식점', '신림동')

,SUM(MON_SELNG_AMT),SUM(TUES_SELNG_AMT),SUM(WED_SELNG_AMT),SUM(THUR_SELNG_AMT),SUM(FRI_SELNG_AMT),SUM(SAT_SELNG_AMT),SUM(SUN_SELNG_AMT)
0,277338357950,277255661985,273277009273,272697215708,309325572561,347703497528,264572150140

---  
## 평일&주말 매출 합계

In [6]:
def salesByWeekAndWeekend(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(MDWK_SELNG_AMT), " +
                          "SUM(WKEND_SELNG_AMT) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    salesByWeekAndWeekend = pd.DataFrame(rows, columns=col)
    
    return salesByWeekAndWeekend

salesByWeekAndWeekend(2018, 1, '한식음식점', '관악구')

   SUM(MDWK_SELNG_AMT)  SUM(WKEND_SELNG_AMT)
0        8709362992641         3473715805834

---  
## 시간대별 매출 합계

In [8]:
def salesByTime(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(TMZON_00_06_SELNG_AMT), " +
                          "SUM(TMZON_06_11_SELNG_AMT), " +
                          "SUM(TMZON_11_14_SELNG_AMT), " +
                          "SUM(TMZON_14_17_SELNG_AMT), " +
                          "SUM(TMZON_17_21_SELNG_AMT), " +
                          "SUM(TMZON_21_24_SELNG_AMT) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    salesByTime = pd.DataFrame(rows, columns=col)
    
    return salesByTime

salesByTime(2018, 1, '한식음식점', '신림동')

,SUM(TMZON_00_06_SELNG_AMT),SUM(TMZON_06_11_SELNG_AMT),SUM(TMZON_11_14_SELNG_AMT),SUM(TMZON_14_17_SELNG_AMT),SUM(TMZON_17_21_SELNG_AMT),SUM(TMZON_21_24_SELNG_AMT)
0,163206262933,148379219688,321047385751,393141811944,676509788310,319884996519

---  
## 성별 매출 합계

In [9]:
def salesByGender(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(ML_SELNG_AMT), " +
                          "SUM(FML_SELNG_AMT) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    salesByGender = pd.DataFrame(rows, columns=col)
    
    return salesByGender

salesByGender(2018, 1, '한식음식점', '서울대병원')

   SUM(ML_SELNG_AMT)  SUM(FML_SELNG_AMT)
0          450590798           309282077

---  
## 나이별 매출 합계

In [10]:
def salesByAge(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(AGRDE_10_SELNG_AMT), " +
                          "SUM(AGRDE_20_SELNG_AMT), " +
                          "SUM(AGRDE_30_SELNG_AMT), " +
                          "SUM(AGRDE_40_SELNG_AMT), " +
                          "SUM(AGRDE_50_SELNG_AMT), " +
                          "SUM(AGRDE_60_ABOVE_SELNG_AMT) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    salesByAge = pd.DataFrame(rows, columns=col)
    
    return salesByAge

salesByAge(2018, 1, '한식음식점', '서울대병원')

,SUM(AGRDE_10_SELNG_AMT),SUM(AGRDE_20_SELNG_AMT),SUM(AGRDE_30_SELNG_AMT),SUM(AGRDE_40_SELNG_AMT),SUM(AGRDE_50_SELNG_AMT),SUM(AGRDE_60_ABOVE_SELNG_AMT)
0,3587780,128101155,164399974,200734387,167863246,95186341

# -------------------------------- 매출 건수 --------------------------------

## 요일별 매출 건수

In [11]:
def countByWeek(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(MON_SELNG_CO), " +
                       "SUM(TUES_SELNG_CO), " +
                       "SUM(WED_SELNG_CO), " +
                       "SUM(THUR_SELNG_CO), " +
                       "SUM(FRI_SELNG_CO), " +
                       "SUM(SAT_SELNG_CO), " + 
                       "SUM(SUN_SELNG_CO) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

# MON_SELNG_CO
# TUES_SELNG_CO
# WED_SELNG_CO
# THUR_SELNG_CO
# FRI_SELNG_CO
# SAT_SELNG_CO
# SUN_SELNG_CO

    for i in colname:
        col.append(i[0])
    countByWeek = pd.DataFrame(rows, columns=col)
    
    return countByWeek

countByWeek(2018, 1, '한식음식점', '서울대병원')

,SUM(MON_SELNG_CO),SUM(TUES_SELNG_CO),SUM(WED_SELNG_CO),SUM(THUR_SELNG_CO),SUM(FRI_SELNG_CO),SUM(SAT_SELNG_CO),SUM(SUN_SELNG_CO)
0,9805,10747,10173,9164,9384,4295,2364

---  
## 평일&주말 매출 건수

In [12]:
def countByWeekAndWeekend(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(MDWK_SELNG_CO), " +
                          "SUM(WKEND_SELNG_CO) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    countByWeekAndWeekend = pd.DataFrame(rows, columns=col)
    
    return countByWeekAndWeekend

countByWeekAndWeekend(2018, 1, '한식음식점', '서울대병원')

   SUM(MDWK_SELNG_CO)  SUM(WKEND_SELNG_CO)
0               49273                 6659

---  
## 시간대별 매출 건수

In [13]:
def countByTime(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(TMZON_00_06_SELNG_CO), " +
                          "SUM(TMZON_06_11_SELNG_CO), " +
                          "SUM(TMZON_11_14_SELNG_CO), " +
                          "SUM(TMZON_14_17_SELNG_CO), " +
                          "SUM(TMZON_17_21_SELNG_CO), " +
                          "SUM(TMZON_21_24_SELNG_CO) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    countByTime = pd.DataFrame(rows, columns=col)
    
    return countByTime

countByTime(2018, 1, '한식음식점', '서울대병원')

,SUM(TMZON_00_06_SELNG_CO),SUM(TMZON_06_11_SELNG_CO),SUM(TMZON_11_14_SELNG_CO),SUM(TMZON_14_17_SELNG_CO),SUM(TMZON_17_21_SELNG_CO),SUM(TMZON_21_24_SELNG_CO)
0,20,2926,29209,7422,15124,1231

---  
## 성별 매출 건수

In [4]:
def countByGender(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(ML_SELNG_CO), " +
                          "SUM(FML_SELNG_CO) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    countByGender = pd.DataFrame(rows, columns=col)
    
    return countByGender

countByGender(2018, 1, '한식음식점', '서울대병원')

   SUM(ML_SELNG_CO)  SUM(FML_SELNG_CO)
0             29820              20767

---  
## 나이별 매출 건수

In [5]:
def countByAge(year, quarter, svc_nm, cd_nm):
    cursor.execute("SELECT SUM(AGRDE_10_SELNG_CO), " +
                          "SUM(AGRDE_20_SELNG_CO), " +
                          "SUM(AGRDE_30_SELNG_CO), " +
                          "SUM(AGRDE_40_SELNG_CO), " +
                          "SUM(AGRDE_50_SELNG_CO), " +
                          "SUM(AGRDE_60_ABOVE_SELNG_CO) " +
                   "FROM SALES " +
                   "WHERE stdr_yy_cd = " + str(year) + " AND " +
                        "STDR_QU_CD = " + str(quarter) + " AND " +
                        "SVC_INDUTY_CD_NM = " + "'" + svc_nm + "'" + " AND " +
                        "TRDAR_CD_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_TW_NM = " + "'" + cd_nm + "'" + " OR " +
                        "TRDAR_VG_NM = " + "'" + cd_nm + "'"
                  )
    rows = cursor.fetchall()
    colname =cursor.description
    col=[]

    for i in colname:
        col.append(i[0])
    countByAge = pd.DataFrame(rows, columns=col)
    
    return countByAge

countByAge(2018, 1, '한식음식점', '서울대병원')

,SUM(AGRDE_10_SELNG_CO),SUM(AGRDE_20_SELNG_CO),SUM(AGRDE_30_SELNG_CO),SUM(AGRDE_40_SELNG_CO),SUM(AGRDE_50_SELNG_CO),SUM(AGRDE_60_ABOVE_SELNG_CO)
0,463,12481,12214,11088,9285,5053